experiments/results/fio-rand/9-ext4-native-randwrite-4.txt
/mnt/test_file: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes

/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=249089: Sun Dec 14 03:14:36 2025
  write: IOPS=112k, BW=437MiB/s (458MB/s)(4368MiB/10001msec); 0 zone resets
    clat (nsec): min=1770, max=8469.0k, avg=3272.13, stdev=9822.19
     lat (nsec): min=1820, max=8469.5k, avg=3353.74, stdev=9824.31
    clat percentiles (nsec):
     |  1.00th=[  1928],  5.00th=[  2040], 10.00th=[  2096], 20.00th=[  2192],
     | 30.00th=[  2256], 40.00th=[  2320], 50.00th=[  2416], 60.00th=[  2608],
     | 70.00th=[  4016], 80.00th=[  4320], 90.00th=[  5152], 95.00th=[  5600],
     | 99.00th=[  8160], 99.50th=[  9920], 99.90th=[ 17280], 99.95th=[ 21376],
     | 99.99th=[346112]
   bw (  KiB/s): min=66584, max=524880, per=25.11%, avg=445010.11, stdev=141556.73, samples=19
   iops        : min=16646, max=131220, avg=111252.53, stdev=35389.18, samples=19
  lat (usec)   : 2=3.27%, 4=65.94%, 10=30.30%, 20=0.42%, 50=0.05%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 10=0.01%
  fsync/fdatasync/sync_file_range:
    sync (usec): min=2, max=5918, avg= 3.82, stdev=14.96
    sync percentiles (nsec):
     |  1.00th=[ 2416],  5.00th=[ 2544], 10.00th=[ 2576], 20.00th=[ 2672],
     | 30.00th=[ 2736], 40.00th=[ 2864], 50.00th=[ 3088], 60.00th=[ 4320],
     | 70.00th=[ 4512], 80.00th=[ 4704], 90.00th=[ 4960], 95.00th=[ 5280],
     | 99.00th=[ 7392], 99.50th=[14400], 99.90th=[16512], 99.95th=[17792],
     | 99.99th=[23168]
  cpu          : usr=15.78%, sys=82.86%, ctx=4742, majf=0, minf=17
  IO depths    : 1=200.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1118173,0,0 short=0,1118173,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=249090: Sun Dec 14 03:14:36 2025
  write: IOPS=110k, BW=432MiB/s (453MB/s)(4316MiB/10001msec); 0 zone resets
    clat (nsec): min=1800, max=8547.3k, avg=3393.08, stdev=8495.69
     lat (nsec): min=1860, max=8547.9k, avg=3476.89, stdev=8497.01
    clat percentiles (nsec):
     |  1.00th=[ 1928],  5.00th=[ 2040], 10.00th=[ 2128], 20.00th=[ 2224],
     | 30.00th=[ 2288], 40.00th=[ 2416], 50.00th=[ 2640], 60.00th=[ 4016],
     | 70.00th=[ 4192], 80.00th=[ 4320], 90.00th=[ 4576], 95.00th=[ 5216],
     | 99.00th=[ 8256], 99.50th=[10688], 99.90th=[15680], 99.95th=[21120],
     | 99.99th=[90624]
   bw (  KiB/s): min=191096, max=518000, per=26.30%, avg=466033.78, stdev=100857.45, samples=18
   iops        : min=47774, max=129500, avg=116508.44, stdev=25214.36, samples=18
  lat (usec)   : 2=3.10%, 4=55.38%, 10=40.95%, 20=0.52%, 50=0.05%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 10=0.01%
  fsync/fdatasync/sync_file_range:
    sync (usec): min=2, max=3971, avg= 3.71, stdev=13.18
    sync percentiles (nsec):
     |  1.00th=[ 2480],  5.00th=[ 2576], 10.00th=[ 2608], 20.00th=[ 2704],
     | 30.00th=[ 2768], 40.00th=[ 2864], 50.00th=[ 2960], 60.00th=[ 3440],
     | 70.00th=[ 4512], 80.00th=[ 4704], 90.00th=[ 4960], 95.00th=[ 5280],
     | 99.00th=[ 7264], 99.50th=[11584], 99.90th=[15808], 99.95th=[16512],
     | 99.99th=[22656]
  cpu          : usr=17.01%, sys=81.78%, ctx=4722, majf=0, minf=16
  IO depths    : 1=200.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1104976,0,0 short=0,1104975,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=249091: Sun Dec 14 03:14:36 2025
  write: IOPS=111k, BW=434MiB/s (455MB/s)(4336MiB/10001msec); 0 zone resets
    clat (nsec): min=1780, max=8369.1k, avg=3352.81, stdev=8651.60
     lat (nsec): min=1840, max=8369.7k, avg=3437.48, stdev=8653.11
    clat percentiles (nsec):
     |  1.00th=[  1928],  5.00th=[  2040], 10.00th=[  2128], 20.00th=[  2224],
     | 30.00th=[  2288], 40.00th=[  2384], 50.00th=[  2544], 60.00th=[  3952],
     | 70.00th=[  4192], 80.00th=[  4320], 90.00th=[  4640], 95.00th=[  5344],
     | 99.00th=[  8256], 99.50th=[ 10176], 99.90th=[ 16192], 99.95th=[ 21120],
     | 99.99th=[108032]
   bw (  KiB/s): min= 6632, max=522128, per=24.93%, avg=441854.74, stdev=145492.24, samples=19
   iops        : min= 1658, max=130532, avg=110463.68, stdev=36373.06, samples=19
  lat (usec)   : 2=3.03%, 4=58.41%, 10=38.04%, 20=0.46%, 50=0.05%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 10=0.01%
  fsync/fdatasync/sync_file_range:
    sync (usec): min=2, max=3973, avg= 3.76, stdev=13.14
    sync percentiles (nsec):
     |  1.00th=[ 2448],  5.00th=[ 2576], 10.00th=[ 2608], 20.00th=[ 2704],
     | 30.00th=[ 2768], 40.00th=[ 2896], 50.00th=[ 3024], 60.00th=[ 4256],
     | 70.00th=[ 4512], 80.00th=[ 4704], 90.00th=[ 5024], 95.00th=[ 5280],
     | 99.00th=[ 7328], 99.50th=[11584], 99.90th=[16512], 99.95th=[17024],
     | 99.99th=[22912]
  cpu          : usr=15.26%, sys=83.51%, ctx=4713, majf=0, minf=17
  IO depths    : 1=200.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1110105,0,0 short=0,1110105,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=249092: Sun Dec 14 03:14:36 2025
  write: IOPS=110k, BW=429MiB/s (450MB/s)(4288MiB/10001msec); 0 zone resets
    clat (nsec): min=1810, max=8377.1k, avg=3499.58, stdev=8431.26
     lat (nsec): min=1869, max=8377.8k, avg=3589.13, stdev=8432.34
    clat percentiles (nsec):
     |  1.00th=[  1944],  5.00th=[  2096], 10.00th=[  2160], 20.00th=[  2256],
     | 30.00th=[  2352], 40.00th=[  2480], 50.00th=[  3664], 60.00th=[  4128],
     | 70.00th=[  4256], 80.00th=[  4384], 90.00th=[  4640], 95.00th=[  5152],
     | 99.00th=[  8512], 99.50th=[ 10816], 99.90th=[ 15552], 99.95th=[ 21888],
     | 99.99th=[123392]
   bw (  KiB/s): min=25272, max=513864, per=24.91%, avg=441505.68, stdev=140158.15, samples=19
   iops        : min= 6318, max=128466, avg=110376.42, stdev=35039.54, samples=19
  lat (usec)   : 2=2.15%, 4=52.04%, 10=45.21%, 20=0.54%, 50=0.05%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 10=0.01%
  fsync/fdatasync/sync_file_range:
    sync (usec): min=2, max=3974, avg= 3.71, stdev=13.22
    sync percentiles (nsec):
     |  1.00th=[ 2480],  5.00th=[ 2576], 10.00th=[ 2640], 20.00th=[ 2704],
     | 30.00th=[ 2768], 40.00th=[ 2864], 50.00th=[ 2960], 60.00th=[ 3280],
     | 70.00th=[ 4512], 80.00th=[ 4704], 90.00th=[ 5024], 95.00th=[ 5344],
     | 99.00th=[ 7392], 99.50th=[11584], 99.90th=[16512], 99.95th=[17280],
     | 99.99th=[22912]
  cpu          : usr=16.44%, sys=82.33%, ctx=4710, majf=0, minf=18
  IO depths    : 1=200.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1097645,0,0 short=0,1097645,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1731MiB/s (1815MB/s), 429MiB/s-437MiB/s (450MB/s-458MB/s), io=16.9GiB (18.1GB), run=10001-10001msec

Disk stats (read/write):
  nvme0n1: ios=4/4376872, merge=0/1, ticks=33/80641, in_queue=80677, util=90.81%